## 订单同步接口
### 1.订单实时查询
#### 1.1 接口描述
> 实时推送订单信息到商户erp，只在付款成功或退款成功时推送订单信息，需双方确认状态
#### 1.2 请求方式
> POST
#### 1.3 url
> /offline/tradesList
#### 1.4 数据方向
> 系统方至商户方
#### 1.5 请求参数
| 接口名称 | 接口描述 | 数据方向 | 建议优先级 |
| :---         |     :---      |     :--- | :--- |
| 订单推送   | 订单相关信息对商户方的推送，包含商品信息、价格信息购买人信息、随单积分等     | 从51JK到商户    |***** p1    |
| 会员信息   | 新会员信息以及老会员信息变更     | 从商户到51JK    |**** p2    |
| 库存信息   | 实时库存以及盘点库存数据     | 从商户到51JK    |**** p3    |
| 优惠券   | 后台配置及生成的优惠券信息     | 从51JK到商户    |**** p4   |
| 订单同步   | 订单相关信息对51的同步     | 从商户到51JK    |**** p4   |
--------------------- 
#### 1. 返回示例
 ``` 
{
  "msg": "订单查询成功",
  "code": 0,//0:成功，-1：失败
  "tradesList":
    {
      "realPay": 180,//实付款
      "receiverName": "老王",//收货人姓名
      "mobile": "13800001111",//收货人手机号码
      "postFee": 0,//运费
      "orderList": [//商品列表
        {
          "gprice": 100,//商品价格
          "gsc": "10mg*100s",//商品规格
          "gcode": "32301029",//商品编码
          "gnum": 1//购买数量
        }
      ],
      "discount": 0,//优惠金额
      "paystyle": "wx",//支付方式:ali (支付宝) ，wx (微信)， bil(快钱)， unionPay(银联)， health_insurance（医保），cash（现金）
      "poststyle": 170,//购买方式，150：送货上门；160：门店自提；170：门店直购
      "tId": 1002241501752197580,//订单编号
      "uid": "123",//门店编码
      "totalPay": 180,//商品金额+运费
      "totalFee": 180,//商品金额
      "receicerAddress": "",//收货地址
      "memberMobile": "13800001111",//会员手机号码
      "status": 1//订单状态：1：已付款（未退款），0：已退款
    },
}
```
